# ==========================================
# БЛОК 1: СБОР ДАННЫХ ОТ ПОЛЬЗОВАТЕЛЯ
# ==========================================
# Функция должна:
def get_user_input():
# 1. Запросить у пользователя путь к txt-файлу.
    way_to_user_file=input("Только  .txt файлы. Введите путь к файлу: ")
# 2. Запросить слово, букву или фразу для поиска.
    object_of_user_search=input("Введите искомый обьект: ")
# 3.  Очистить от мусора
    way_to_user_file = way_to_user_file.strip().strip('"').strip("'")    
    object_of_user_search=object_of_user_search.strip() 
# 4. Вернуть эти два значения дальше в программу.
    return(way_to_user_file, object_of_user_search)


# ==========================================
# БЛОК 2: ОБРАБОТКА И ПОИСК В ФАЙЛЕ
# ==========================================
# Функция должна принимать: путь к файлу и искомую строку.
# Внутри себя функция должна:
# 1. Открыть файл на чтение с правильной кодировкой (utf-8).
# 2. Пройтись циклом по каждой строке с использованием enumerate (чтобы вести отсчёт номеров строк с 1).
# 3. Проверить, содержится ли искомый текст в текущей строке.
# 4. Если содержится:
#    - Сохранить КОРТЕЖ (номер строки, сам текст строки) в список совпадений.
#    - Увеличить счётчик найденных элементов.
# 5. Вернуть список кортежей вида [(3, "текст"), (25, "текст")] и общее количество совпадений.


# ==========================================
# БЛОК 3: ГЛАВНАЯ ФУНКЦИЯ И ВЫВОД РЕЗУЛЬТАТОВ
# ==========================================
# Функция main должна:
# 1. Вызвать Блок 1 (получить путь и искомую строку).
# 2. Передать эти данные в Блок 2 (получить результаты поиска).
# 3. Вывести в консоль:
#    - Общее количество найденных совпадений.
#    - Вывести каждую найденную строку с явным указанием номера:
#      Пример вывода: "Строка № 25: <содержимое строки>"